app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT * FROM `companies`

  def show
    @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 3)

  def create
    @company = Company.new(params[:company])
    @emails = {}
    respond_to do |format|
      if @company.save
        @company.users.each do |user|
          if Rails.env == "production"
            email = TrucksEmail.deliver_registration_confirmation(user)
          else
            email = TrucksEmail.create_registration_confirmation(user)
---
INSERT INTO `companies` (`name`, `address1`, `address2`, `updated_at`, `abn`, `postcode`, `pref_type`, `town`, `phone`, `state`, `created_at`) VALUES('', '', '', '2009-07-25 20:22:31', '', '', '', '', '', '', '2009-07-25 20:22:31')
INSERT INTO `users` (`salt`, `updated_at`, `activated_at`, `crypted_password`, `last_action`, `remember_token_expires_at`, `activation_code`, `remember_token`, `company_id`, `login`, `created_at`, `ip_address`) VALUES('72219e1747e440784e722bbc3bd6107a8ef196f2', '2009-07-26 00:12:48', NULL, 'dd3bde96011cbc7dbcafd88da92a920a268b272a', NULL, NULL, '200dfcc3c614f2aed1c5d837d261200841036698', NULL, 5, 'dw_fred@yah.com', '2009-07-26 00:12:48', NULL)