app/controllers/loads_controller.rb

  def your
    @loads = current_user.company.loads #.paginate :page => params[:page]
    load = @loads.first
---
SELECT * FROM `loads` WHERE (`loads`.company_id = 10) ORDER BY created_at DESC LIMIT 1

  def index
    @loads = Load.all(:order => 'created_at DESC', :conditions => ['company_id != ?',current_user.company_id])
---
SELECT * FROM `loads`

  def show
    @load = Load.find(params[:id])
---
SELECT * FROM `loads` WHERE (`loads`.`id` = 0)

  def create
    @load = Load.new(params[:load])
    @load.company = current_user.company

    respond_to do |format|
      if @load.save
---
INSERT INTO `loads` (`start_lng`, `end_lng`, `updated_at`, `details`, `end_lat`, `start_lat`, `end_loc`, `filled`, `start_loc`, `load_date`, `company_id`, `deleted`, `load_type`, `distance`, `created_at`) VALUES(150.184615, 148.790592, '2009-07-26 23:09:47', NULL, -26.573907, -26.658062, 'Roma Queensland 4455, Australia', 0, 'Miles Queensland 4415, Australia', '2009-01-14', 10, 0, 'contract', NULL, '2009-07-26 23:09:47')