app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`activation_code` = '950deb3b41ffd89f7c721233db327c33ca3a5c32') LIMIT 1
---
  def activate
    logout_keeping_session!
    @user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?